app/controllers/proposal_viewer_controller.rb

SELECT "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    proposal = Proposal.find(params[:id])